#+setupfile: info/index-bigblow-header.setup
#+include: info/common-header.org
#+AUTHOR: 鈴木正幸，非常勤講師
#+title: 確率と統計 8.点推定
#+OPTIONS: tex:t
#+property: header-arg:R :session *rfors* :results output :exports both :width 400 :height 300

*** 「満足」と答える確率 \( \eta = P(Z=1) \)

    |------------+-----------------------+---------------------|
    |            | \( Y=1 \), 本当を言う | \( Y=0 \), 嘘を言う |
    | \( X= 1 \) | \(Z = 1 \)            | \( Z = 0 \)         |
    | \( X= 0 \) | \(Z = 0 \)            | \( Z = 1 \)         |
    |------------+-----------------------+---------------------|

    \( \eta = P(Z=1) \) = \( P(X=1, Y=1) + P(X=0, Y=0) \)

    \( = P(X=1) P(Y=1) + P(X=0) P(Y=0) \)

    \( = \theta \alpha + (1-\theta)(1-\alpha) \)

    \( = (2\alpha -1)\theta + (1-\alpha) \)

    \( \overline{Z_{(n)}} \) は \( \eta \) の妥当な推定量。

    なので，\(\hat{\eta} = \overline{Z_{(n)}} =  (2\alpha -1)\theta + (1-\alpha) \)

    \( \hat{\theta} = \frac{\overline{Z_{(n)}}}{2\alpha-1}\)


    #+begin_src R :session *stext* :results output :exports both
##
## 教科書 8.5.1 アンケート
##
est_theta <- function (enq, alpha) {
  (mean(enq)-(1-alpha))/(2*alpha-1)
}

size <- 1000
honest_p <- 1/3
satisfied_p <- 6/10

honest <- rep(0,size)
honest [(runif(size,0,1))>(1-honest_p)] <- 1
table(dice)

satisfied <- rep(0,size)
satisfied [(runif(size,0,1))>(1-satisfied_p)] <- 1

table(satisfied)
enq <- rep(0,size)
for (i in 1:size) {
    res <- 0
    if (honest[i]==satisfied[i]) { res <- 1 }
    enq[i] <- res
}

mean(honest)
mean(satisfied)
mean(enq)
est_theta(enq, honest_p)
    #+end_src

    #+RESULTS:
    #+begin_example
    dice
      0   1 
    354 646
    satisfied
      0   1 
    439 561
    [1] 0.309
    [1] 0.561
    [1] 0.514
    [1] 0.458
    #+end_example


